#### Terraform Apply 🎬`success`

<details><summary>Show Result</summary>

```

terraform
local_file.appspec: Refreshing state... [id=1dbb9c90d303cbcfe69db59b8fd829bae08b9b25]
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Reading...
data.aws_vpc.vpc: Reading...
data.aws_security_group.ecs: Reading...
aws_iam_role.ecs_task_role: Refreshing state... [id=demo-fargate-app-ecsTaskRole]
aws_ecr_repository.app_repo: Refreshing state... [id=demo-fargate-app]
aws_cloudwatch_log_group.log_group: Refreshing state... [id=demo-fargate-app-logs]
aws_iam_policy.codedeploy_policy: Refreshing state... [id=arn:aws:iam::369168831564:policy/demo-fargate-app-codeDeployPolicy]
data.aws_resourcegroupstaggingapi_resources.alb: Reading...
aws_codedeploy_app.codedeploy_app: Refreshing state... [id=9ebf67a6-5e41-4385-af3c-4091233fad80:demo-fargate-app]
aws_iam_role.codedeploy_role: Refreshing state... [id=demo-fargate-app-codeDeployRole]
data.aws_resourcegroupstaggingapi_resources.ecs_cluster: Read complete after 0s [id=aws]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole]
data.aws_resourcegroupstaggingapi_resources.alb: Read complete after 0s [id=aws]
data.aws_lb_listener.alb_listener: Reading...
aws_ecr_lifecycle_policy.repo_policy: Refreshing state... [id=demo-fargate-app]
data.aws_lb_listener.alb_listener: Read complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c]
data.aws_security_group.ecs: Read complete after 0s [id=sg-0abc9927f6f2f7abd]
aws_iam_role_policy_attachment.codedeploy_role_policy_attachment: Refreshing state... [id=demo-fargate-app-codeDeployRole-20230119173134349300000002]
aws_iam_role_policy_attachment.ecs_task_execution_role_policy_attachment: Refreshing state... [id=demo-fargate-app-ecsTaskExecutionRole-20230119173134335800000001]
aws_ecs_task_definition.task_def: Refreshing state... [id=demo-fargate-app]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-09588034d45d4bae9]
aws_lb_target_group.bluegreen2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/demo-fargate-app-bluegreen2/76308b1d46f11e7d]
aws_lb_target_group.bluegreen1: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:targetgroup/demo-fargate-app-bluegreen1/90c681de0bcea3ab]
data.aws_subnets.subnets: Reading...
data.aws_subnets.subnets: Read complete after 0s [id=us-east-1]
aws_lb_listener_rule.listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c/036ab8d3c42a9a72]
aws_ecs_service.service: Refreshing state... [id=arn:aws:ecs:us-east-1:369168831564:service/ecs-fargate/demo-fargate-app]
aws_codedeploy_deployment_group.app_deployment_group: Refreshing state... [id=fcb1bf39-f568-49d4-9d15-b8faea121dd4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lb_listener_rule.listener_rule is tainted, so must be replaced
-/+ resource "aws_lb_listener_rule" "listener_rule" {
      ~ arn          = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c/036ab8d3c42a9a72" -> (known after apply)
      ~ id           = "arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c/036ab8d3c42a9a72" -> (known after apply)
      ~ priority     = 1 -> (known after apply)
      - tags         = {} -> null
      ~ tags_all     = {} -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ action {
          ~ order            = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # local_file.appspec will be created
  + resource "local_file" "appspec" {
      + content              = <<-EOT
            Resources:
              - TargetService:
                  Type: AWS::ECS::Service
                  Properties:
                    TaskDefinition: <TASK_DEFINITION>
                    LoadBalancerInfo:
                      ContainerName: demo-fargate-app
                      ContainerPort: 8080
        EOT
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../appspec.yaml"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
local_file.appspec: Creating...
local_file.appspec: Creation complete after 0s [id=1dbb9c90d303cbcfe69db59b8fd829bae08b9b25]
aws_lb_listener_rule.listener_rule: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c/036ab8d3c42a9a72]
aws_lb_listener_rule.listener_rule: Destruction complete after 0s
aws_lb_listener_rule.listener_rule: Creating...
aws_lb_listener_rule.listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:369168831564:listener-rule/app/demo-alb/8a9eeb265d836dbe/02c783ce0a62a09c/1ac3b5b1d0a06679]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>
